Revit 2027 API
KeyBasedTreeEntriesLoadResults.GetFileSyntaxErrors Method
 Gets all the records in the key-based tree data text file that could not be parsed into KeyBasedTreeEntries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetFileSyntaxErrors()
Public Function GetFileSyntaxErrors As IList(Of String)
public:
IList<String^>^ GetFileSyntaxErrors()
member GetFileSyntaxErrors : unit -> IList<string>
Return Value
IList<String>
 An array of strings that are copies of the records in the text file that could not be parsed.
Remarks
 Only applies to KeyBasedTreeEntries built from text files.
See Also
Reference
KeyBasedTreeEntriesLoadResults Class
Autodesk.Revit.DB Namespace